Repository: isinicyn/FlatPatternExporter
Catalog: FlatPatternExporter/Resources/Strings.*.resx
Languages: ru

# Message_SomeFlatPatternsSkipped
source: Some selected files do not contain flat patterns and will be skipped. Continue?
ru: Некоторые выбранные файлы не содержат разверток и будут пропущены. Продолжить?

# Status_PreparingPartData
source: Preparing part data ({0}/{1})...
ru: Подготовка данных деталей ({0}/{1})...

# Error_TemplateNotFound
source: Template {0} not found
ru: Шаблон {0} не найден

# Error_PropertyUpdateFailed
source: Failed to update property '{0}'.
ru: Не удалось обновить свойство '{0}'.

# Error_ExpressionUpdateFailed
source: Failed to update property expression '{0}'.
ru: Не удалось обновить выражение свойства '{0}'.

# Error_ProjectInfoGet
source: Failed to get project information: {0}
ru: Не удалось получить информацию о проекте: {0}

# Error_FileOpen
source: Error opening file at path {0}: {1}
ru: Ошибка при открытии файла по пути {0}: {1}

# Error_DocumentNotFound
source: Document with part number {0} not found among open documents.
ru: Документ с номером детали {0} не найден среди открытых.

# Error_FileNotFoundForPart
source: File associated with part number {0} not found among open documents.
ru: Файл, связанный с номером детали {0}, не найден среди открытых.

# Warning_ColumnAlreadyExists
source: Column with name '{0}' already exists.
ru: Столбец с именем '{0}' уже существует.

# Warning_PropertyAlreadyAdded
source: Property '{0}' already added.
ru: Свойство '{0}' уже добавлено.

# Info_NoOverriddenQuantities
source: No overridden quantities in selected items.
ru: В выбранных элементах нет переопределенных количеств.

# MessageBox_Confirmation
source: Confirmation
ru: Подтверждение

# Message_ConfirmDelete
source: Are you sure you want to delete {0} row(s)?
ru: Вы действительно хотите удалить {0} строк(и)?

# MessageBox_Warning
source: Warning
ru: Предупреждение

# Error_TemplateError
source: Template error
ru: Ошибка в шаблоне

# Error_UnknownTokens
source: Template error - unknown tokens
ru: Ошибка в шаблоне - неизвестные токены

# Error_DocumentChanged
source: Active document has changed. Please repeat scanning before export.
ru: Активный документ изменился. Пожалуйста, повторите сканирование перед экспортом.

# Error_ExportPreparationWithMessage
source: Export preparation error: {0}
ru: Ошибка при подготовке экспорта: {0}

# Error_PartFileNotFound
source: Part file not found or cannot be opened
ru: Файл детали не найден или не может быть открыт

# Error_DxfExport
source: DXF export error: {0}
ru: Ошибка экспорта DXF: {0}

# Error_PartProcessing
source: Part processing error: {0}
ru: Ошибка обработки детали: {0}

# Info_TemplateNotSet
source: Template not set - default value "Part Number" will be used during export
ru: Не задан шаблон - при экспорте будет использовано значение по умолчанию "Обозначение детали"

# Error_FileNameTooLong
source: File name is too long ({0} characters, maximum 255)
ru: Имя файла слишком длинное ({0} символов, максимум 255)

# Warning_FileLocked
source: File {0} is locked by another application. Abort operation?
ru: Файл {0} занят другим приложением. Прервать операцию?

# MessageBox_Info
source: Information
ru: Информация

# Info_WaitingForFileUnlock
source: Waiting for file unlock. The file may be open in a viewer. Close the file and click OK.
ru: Ожидание разблокировки файла. Возможно файл открыт в программе просмотра. Закройте файл и нажмите OK.

# Status_ComponentProgress
source: Component {0} of {1}
ru: Компонент {0} из {1}

# Status_BomRowProgress
source: Row {0} of {1}
ru: Строка {0} из {1}

# Validation_InvalidLayerNameCharacters
source: Invalid characters in layer name. The following characters are not allowed in layer names: <>/\\":;?*|,=
ru: Недопустимые символы в имени слоя. В именах слоев не допускается употребление следующих символов: <>/\\":;?*|,=

# MessageBox_InputError
source: Input Error
ru: Ошибка ввода

# SplineReplacement_Lines
source: Lines
ru: Линии

# SplineReplacement_Arcs
source: Arcs
ru: Дуги

# Layer_OuterProfile
source: Outer Profile
ru: Внешний профиль

# Layer_InteriorProfiles
source: Interior Profiles
ru: Внутренние профили

# Layer_BendUp
source: Bend Up
ru: Гибка вверх

# Layer_BendDown
source: Bend Down
ru: Гибка вниз

# Layer_ToolCenterUp
source: Tool Center Up
ru: Центр инструмента вверх

# Layer_ToolCenterDown
source: Tool Center Down
ru: Центр инструмента вниз

# Layer_Tangent
source: Tangent
ru: Касательная

# Layer_RollLines
source: Roll Lines
ru: Линии прокатки

# Layer_TangentRollLines
source: Tangent Roll Lines
ru: Касательные линии прокатки

# Layer_ArcCenters
source: Arc Centers
ru: Центры дуг

# Layer_FeatureProfilesUp
source: Feature Profiles Up
ru: Профили элементов вверх

# Layer_FeatureProfilesDown
source: Feature Profiles Down
ru: Профили элементов вниз

# Layer_UnconsumedSketchConstruction
source: Unconsumed Sketch Construction
ru: Неиспользованные конструкции

# Layer_UnconsumedSketches
source: Unconsumed Sketches
ru: Неиспользованные эскизы

# Layer_AltRepFront
source: Alt. Rep Front
ru: Альт. представление спереди

# Layer_AltRepBack
source: Alt. Rep Back
ru: Альт. представление сзади

source: White
ru: Белый

source: Red
ru: Красный

source: Orange
ru: Оранжевый

source: Yellow
ru: Желтый

source: Green
ru: Зеленый

source: Cyan
ru: Голубой

source: Blue
ru: Синий

source: Purple
ru: Фиолетовый

source: Dark Gray
ru: Темно-серый

source: Light Gray
ru: Светло-серый

source: Chain
ru: Штрихпунктирная

source: Continuous
ru: Сплошная

source: Dash Dotted
ru: Штрихпунктирная

source: Dashed Double Dotted
ru: Штриховая с двумя точками

source: Dashed Hidden
ru: Штриховая скрытая

source: Dashed
ru: Штриховая

source: Dashed Triple Dotted
ru: Штриховая с тремя точками

source: Default
ru: По умолчанию

source: Dotted
ru: Пунктирная

source: Double Dash Double Dotted
ru: Двойная штриховая с двумя точками

source: Double Dashed
ru: Двойная штриховая

source: Double Dashed Dotted
ru: Двойная штрихпунктирная

source: Double Dash Triple Dotted
ru: Двойная штриховая с тремя точками

source: Long Dash Dotted
ru: Длинная штрихпунктирная

source: Long Dashed Double Dotted
ru: Длинная штриховая с двумя точками

source: Long Dash Triple Dotted
ru: Длинная штриховая с тремя точками

# Property_ProcessingStatus_DisplayName
source: Processing Status
ru: Статус обработки

# Property_ProcessingStatus_ColumnHeader
source: Proc.
ru: Обр.

# Property_ProcessingStatus_Category
source: System
ru: Системные

# Property_Item_DisplayName
source: Numbering
ru: Нумерация

# Property_Item_Category
source: System
ru: Системные

# Property_Quantity_DisplayName
source: Quantity
ru: Количество

# Property_Quantity_ColumnHeader
source: Qty
ru: Кол.

# Property_Quantity_Category
source: Quantity
ru: Количество

# Property_FileName_DisplayName
source: File Name
ru: Имя файла

# Property_FileName_ColumnHeader
source: File Name
ru: Имя файла

# Property_FileName_Category
source: Document
ru: Документ

# Property_FullFileName_DisplayName
source: Full File Name
ru: Полное имя файла

# Property_FullFileName_ColumnHeader
source: Full File Name
ru: Полное имя файла

# Property_FullFileName_Category
source: Document
ru: Документ

# Property_ModelState_DisplayName
source: Model State
ru: Состояние модели

# Property_ModelState_ColumnHeader
source: Model State
ru: Состояние модели

# Property_ModelState_Category
source: Document
ru: Документ

# Property_Thickness_DisplayName
source: Thickness
ru: Толщина

# Property_Thickness_ColumnHeader
source: Thk.
ru: Толщ.

# Property_Thickness_Category
source: Document
ru: Документ

# Property_HasFlatPattern_DisplayName
source: Has Flat Pattern
ru: Наличие развертки

# Property_HasFlatPattern_ColumnHeader
source: Flat Pattern
ru: Развертка

# Property_HasFlatPattern_Category
source: Document
ru: Документ

# Property_Preview_DisplayName
source: Part Image
ru: Изображение детали

# Property_Preview_ColumnHeader
source: Part Img
ru: Изобр. детали

# Property_Preview_Category
source: Document
ru: Документ

# Property_DxfPreview_DisplayName
source: Flat Pattern Image
ru: Изображение развертки

# Property_DxfPreview_ColumnHeader
source: Flat Img
ru: Изобр. развертки

# Property_DxfPreview_Category
source: Processing
ru: Обработка

# Property_Author_DisplayName
source: Author
ru: Автор

# Property_Author_ColumnHeader
source: Author
ru: Автор

# Property_Author_Category
source: Author and Editing
ru: Автор и редактирование

# Property_Revision_DisplayName
source: Revision
ru: Ревизия

# Property_Revision_ColumnHeader
source: Revision
ru: Ревизия

# Property_Revision_Category
source: Author and Editing
ru: Автор и редактирование

# Property_Title_DisplayName
source: Title
ru: Название

# Property_Title_ColumnHeader
source: Title
ru: Название

# Property_Title_Category
source: Author and Editing
ru: Автор и редактирование

# Property_Subject_DisplayName
source: Subject
ru: Тема

# Property_Subject_ColumnHeader
source: Subject
ru: Тема

# Property_Subject_Category
source: Author and Editing
ru: Автор и редактирование

# Property_Keywords_DisplayName
source: Keywords
ru: Ключевые слова

# Property_Keywords_ColumnHeader
source: Keywords
ru: Ключевые слова

# Property_Keywords_Category
source: Author and Editing
ru: Автор и редактирование

# Property_Comments_DisplayName
source: Comments
ru: Примечание

# Property_Comments_ColumnHeader
source: Comments
ru: Примечание

# Property_Comments_Category
source: Author and Editing
ru: Автор и редактирование

# Property_Category_DisplayName
source: Category
ru: Категория

# Property_Category_ColumnHeader
source: Category
ru: Категория

# Property_Category_Category
source: Organizational Info
ru: Организационная информация

# Property_Manager_DisplayName
source: Manager
ru: Менеджер

# Property_Manager_ColumnHeader
source: Manager
ru: Менеджер

# Property_Manager_Category
source: Organizational Info
ru: Организационная информация

# Property_Company_DisplayName
source: Company
ru: Компания

# Property_Company_ColumnHeader
source: Company
ru: Компания

# Property_Company_Category
source: Organizational Info
ru: Организационная информация

# Property_PartNumber_DisplayName
source: Part Number
ru: Обозначение

# Property_PartNumber_ColumnHeader
source: Part Number
ru: Обозначение

# Property_PartNumber_Category
source: Technical Documentation
ru: Техническая документация

# Property_Description_DisplayName
source: Description
ru: Наименование

# Property_Description_ColumnHeader
source: Description
ru: Наименование

# Property_Description_Category
source: Technical Documentation
ru: Техническая документация

# Property_Material_DisplayName
source: Material
ru: Материал

# Property_Material_ColumnHeader
source: Material
ru: Материал

# Property_Material_Category
source: Material and Finish
ru: Материал и отделка

# Property_Project_DisplayName
source: Project
ru: Проект

# Property_Project_ColumnHeader
source: Project
ru: Проект

# Property_Project_Category
source: Technical Documentation
ru: Техническая документация

# Property_StockNumber_DisplayName
source: Stock Number
ru: Инвентарный номер

# Property_StockNumber_ColumnHeader
source: Stock Number
ru: Инвентарный номер

# Property_StockNumber_Category
source: Technical Documentation
ru: Техническая документация

# Property_CreationTime_DisplayName
source: Creation Time
ru: Время создания

# Property_CreationTime_ColumnHeader
source: Creation Time
ru: Время создания

# Property_CreationTime_Category
source: Technical Documentation
ru: Техническая документация

# Property_CostCenter_DisplayName
source: Cost Center
ru: Сметчик

# Property_CostCenter_ColumnHeader
source: Cost Center
ru: Сметчик

# Property_CostCenter_Category
source: Technical Documentation
ru: Техническая документация

# Property_CheckedBy_DisplayName
source: Checked By
ru: Проверил

# Property_CheckedBy_ColumnHeader
source: Checked By
ru: Проверил

# Property_CheckedBy_Category
source: Technical Documentation
ru: Техническая документация

# Property_EngApprovedBy_DisplayName
source: Engr Approved By
ru: Нормоконтроль

# Property_EngApprovedBy_ColumnHeader
source: Engr Approved By
ru: Нормоконтроль

# Property_EngApprovedBy_Category
source: Technical Documentation
ru: Техническая документация

# Property_UserStatus_DisplayName
source: Status
ru: Статус

# Property_UserStatus_ColumnHeader
source: Status
ru: Статус

# Property_UserStatus_Category
source: Technical Documentation
ru: Техническая документация

# Property_CatalogWebLink_DisplayName
source: Web Link
ru: Веб-ссылка

# Property_CatalogWebLink_ColumnHeader
source: Web Link
ru: Веб-ссылка

# Property_CatalogWebLink_Category
source: Technical Documentation
ru: Техническая документация

# Property_Vendor_DisplayName
source: Vendor
ru: Поставщик

# Property_Vendor_ColumnHeader
source: Vendor
ru: Поставщик

# Property_Vendor_Category
source: Technical Documentation
ru: Техническая документация

# Property_MfgApprovedBy_DisplayName
source: Mfg Approved By
ru: Утвердил

# Property_MfgApprovedBy_ColumnHeader
source: Mfg Approved By
ru: Утвердил

# Property_MfgApprovedBy_Category
source: Technical Documentation
ru: Техническая документация

# Property_DesignStatus_DisplayName
source: Design Status
ru: Статус разработки

# Property_DesignStatus_ColumnHeader
source: Design Status
ru: Статус разработки

# Property_DesignStatus_Category
source: Technical Documentation
ru: Техническая документация

# Property_Designer_DisplayName
source: Designer
ru: Проектировщик

# Property_Designer_ColumnHeader
source: Designer
ru: Проектировщик

# Property_Designer_Category
source: Technical Documentation
ru: Техническая документация

# Property_Engineer_DisplayName
source: Engineer
ru: Инженер

# Property_Engineer_ColumnHeader
source: Engineer
ru: Инженер

# Property_Engineer_Category
source: Technical Documentation
ru: Техническая документация

# Property_Authority_DisplayName
source: Authority
ru: Нач. отдела

# Property_Authority_ColumnHeader
source: Authority
ru: Нач. отдела

# Property_Authority_Category
source: Technical Documentation
ru: Техническая документация

# Property_Mass_DisplayName
source: Mass
ru: Масса

# Property_Mass_ColumnHeader
source: Mass
ru: Масса

# Property_Mass_Category
source: Physical Properties
ru: Физические свойства

# Property_SurfaceArea_DisplayName
source: Surface Area
ru: Площадь поверхности

# Property_SurfaceArea_ColumnHeader
source: Surface Area
ru: Площадь поверхности

# Property_SurfaceArea_Category
source: Sheet Metal
ru: Листовой металл

# Property_Volume_DisplayName
source: Volume
ru: Объем

# Property_Volume_ColumnHeader
source: Volume
ru: Объем

# Property_Volume_Category
source: Physical Properties
ru: Физические свойства

# Property_SheetMetalRule_DisplayName
source: Sheet Metal Rule
ru: Правило ЛМ

# Property_SheetMetalRule_ColumnHeader
source: Sheet Metal Rule
ru: Правило ЛМ

# Property_SheetMetalRule_Category
source: Sheet Metal
ru: Листовой металл

# Property_FlatPatternWidth_DisplayName
source: Flat Pattern Width
ru: Ширина развертки

# Property_FlatPatternWidth_ColumnHeader
source: Flat Pattern Width
ru: Ширина развертки

# Property_FlatPatternWidth_Category
source: Sheet Metal
ru: Листовой металл

# Property_FlatPatternLength_DisplayName
source: Flat Pattern Length
ru: Длина развертки

# Property_FlatPatternLength_ColumnHeader
source: Flat Pattern Length
ru: Длина развертки

# Property_FlatPatternLength_Category
source: Sheet Metal
ru: Листовой металл

# Property_FlatPatternArea_DisplayName
source: Area
ru: Площадь

# Property_FlatPatternArea_ColumnHeader
source: Area
ru: Площадь

# Property_FlatPatternArea_Category
source: Sheet Metal
ru: Листовой металл

# Property_Appearance_DisplayName
source: Appearance
ru: Отделка

# Property_Appearance_ColumnHeader
source: Appearance
ru: Отделка

# Property_Appearance_Category
source: Material and Finish
ru: Материал и отделка

# Property_Density_DisplayName
source: Density
ru: Плотность

# Property_Density_ColumnHeader
source: Density
ru: Плотность

# Property_Density_Category
source: Physical Properties
ru: Физические свойства

# Property_LastUpdatedWith_DisplayName
source: Inventor Version
ru: Версия Inventor

# Property_LastUpdatedWith_ColumnHeader
source: Inventor Version
ru: Версия Inventor

# Property_LastUpdatedWith_Category
source: Technical Documentation
ru: Техническая документация

# Property_UserDefined_Prefix
source: (Custom)
ru: (Пользов.)

# Property_UserDefined_Category
source: User Defined Properties
ru: Пользовательские свойства

# Language_English
source: English
ru: Английский

# Text_NoThumbnail
source: No thumbnail
ru: Нет миниатюры

# Time_Minutes_Short
source: min.
ru: мин.

# Time_Seconds_Short
source: sec.
ru: сек.

# DesignStatus_Development
source: Development
ru: Разработка

# DesignStatus_Approval
source: Approval
ru: Утверждение

# DesignStatus_Completed
source: Completed
ru: Завершен

# Message_ResetQuantitySingle
source: Reset quantity for "{0}" to original value {1}?
ru: Сбросить количество для "{0}" до исходного значения {1}?

# Message_ResetQuantityMultiple
source: Reset quantity for {0} selected items to original values?
ru: Сбросить количество для {0} выбранных элементов до исходных значений?

# ToolTip_ExpressionIndicator
source: Value is set by expression (Expression)
ru: Значение задано выражением (Expression)

# ToolTip_FlatPatternMissing
source: Flat pattern is missing
ru: Развертка отсутствует

# ToolTip_FlatPatternAvailable
source: Flat pattern is available
ru: Развертка доступна

# Text_SubstitutionPlaceholder
source: Substitution if empty...
ru: Подстановка если пусто...
